import { SlideData } from '../types/SlideData';

export const advantages: SlideData[] = [
  {
    id: 0,
    img: './img/advantages/01.png',
    title: 'Досвід',
    text: `Ми маємо більш ніж 12-річний досвід під час якого встигли реалізувати сотні проєктів і зарекомендували себе як надійний партнер у створенні неповторних і стильних інтер'єрів.`,
  },
  {
    id: 1,
    img: './img/advantages/02.png',
    title: 'Гнучкість',
    text: `Ми завжди готові вислухати ваші побажання та ідеї і допомогти втілити їх у життя. Кожен наш клієнт - це особлива історія, і ми працюємо, щоб зробити ваш інтер'єр унікальним.`,
  },
  {
    id: 2,
    img: './img/advantages/03.png',
    title: 'Якість',
    text: `Наша трудова етика - вимогливість до якості і це дає результати, які служать вам роками.`,
  },
];
