import { TyInfo } from '../types/Info';

export const footerData: TyInfo[] = [
  {
    title: 'Оплата та доставка',
    description: `- Безготівкова оплата на рахунок компанії.
                  - Готівкою або платіжною карткою в салоні.
                  - Оплата при отриманні у відділенні кур’єрськоїслужби.`,
  },
  {
    title: 'Повернення товару',
    description: `
          Повернення товару належної якості протягом 14 днів здійснюється відповідно до Закону України “Про захист прав споживачів”.
          У період 14 днів, за винятком дня покупки, можна оформитиповернення товару за умов:
            - товар не був в експлуатації;
            - цілісність упаковки не порушена;
            - збережено документ, що підтверджує оплату.
          При виробництві шпалер завжди змінюється номер партії,тому при поверненні ми узгоджуємо наявність шпалер, які бажаєте повернути, на складі і лише тоді повертаєм.`,
  },
  {
    title: 'Політика конфіденційності',
    description: `
Нашим головним пріоритетом є захист ваших персональних даних. У цій Політиці конфіденційності описано, як ми використовуємо інформацію, зібрану на нашому веб-сайті. Ми несемо відповідальність за захист даних та дотримання умов конфіденційності (закон “Про захист персональних даних” та постанова “Про захист персональних даних).
Користуючись нашим сайтом, Ви погоджуєтеся з такими умовами політики про конфіденційність даних:

Персональні дані
Ми збираємо особисту інформацію, таку як ваше ім’я, адреса електронної пошти, адреса доставки та платіжна інформація, коли ви розміщуєте замовлення в нас. Ця інформація використовується для обробки та виконання вашого замовлення. Якщо ви зв’яжетеся з нами електронною поштою чи будь-яким іншим способом зв’язку, ми також можемо збирати та зберігати таку інформацію.
Зберігання та використання персональних даних
Ми цінуємо вашу конфіденційність і хочемо, щоб ви розуміли, як ми обробляємо вашу особисту інформацію. Ми можемо надати вашу інформацію стороннім постачальникам послуг, щоб допомогти нам обробляти замовлення, доставляти продукти, обробляти платежі та здійснювати маркетингову діяльність. Однак ми не передамо вашу особисту інформацію жодній третій стороні без вашої згоди.
У певних ситуаціях нам може знадобитися розкрити вашу інформацію для дотримання вимог законодавства, забезпечення дотримання політики нашого веб-сайту або захисту наших прав, власності чи безпеки, а також прав інших осіб. Ми серйозно ставимося до вашої конфіденційності та завжди намагатимемося захистити вашу особисту інформацію якнайкраще.
Інформація про захист даних
Ми впроваджуємо технічні та організаційні заходи для захисту нашого веб-сайту та інших систем від несанкціонованого доступу, втрати, знищення, зміни або розповсюдження збережених даних, але повний захист від усіх ризиків неможливий, незважаючи на систематичний контроль.
Використання файлів Cookie
Щоб допомогти вам ефективніше використовувати наш веб-сайт, ми використовуємо файли cookie. Важливо зауважити, що файли cookie не містять жодної особистої інформації про вас і не можуть використовуватися для ідентифікації окремого користувача.
Ви можете налаштувати свій браузер на сповіщення перед завантаженням файлів cookie та вимкнути прийняття файлів cookie. Однак це може вплинути на функціональність нашого сайту.

Зміни до Політики конфіденційності
Ми залишаємо за собою право змінювати або оновлювати цю Політику конфіденційності в будь-який час. Такі зміни набудуть чинності негайно після публікації переглянутої політики на нашому веб-сайті. Відкриваючи та використовуючи наш веб-сайт, ви погоджуєтеся з цією Політикою конфіденційності та погоджуєтеся дотримуватися її умов. Якщо у вас виникли запитання чи сумніви щодо нашої політики конфіденційності чи використання вашої особистої інформації, будь ласка, зв’яжіться з нами.
`,
  },
];

export const article: {
  paymentAndDelivery: TyInfo,
  productReturn: TyInfo,
  privacyPolicy: TyInfo,
  personalDataProcessing: TyInfo,
} = {
  paymentAndDelivery: footerData[0],
  productReturn: footerData[1],
  privacyPolicy: footerData[2],
  personalDataProcessing: {
    title: 'Згода з умовами обробки персональних даних',
    description: `
    Вебсайт Decorativka та його складові вебсторінки (надалі разом ― «сайт») надаються ПП«Decorativka» (надалі ― «....», в тому числі «ми» і под.). Decorativka дбає про захист персональних даних, що можуть надаватись відвідувачами і користувачами сайту (надалі ― «вами», «ви», «ваші», «ваш» і под.) під час відвідування сайту, перегляду контенту, направлення заявки на участь та/або реєстрації на будь-який захід, заповнення, складання чи направлення компанії «Decorativka» засобами сайту будь-якого іншого звернення, опитування, підтвердження, відповіді, повідомлення та інше.
    Використовуючи сайт, ви надаєте компанії «Decorativka» згоду на обробку персональних даних та гарантуєте, що всі надані вами дані є достовірними та коректними."`,
  }
};
