import { TyInfo } from '../types/Info';

export const footerData: TyInfo[] = [
  {
    title: 'Оплата та доставка',
    description: `- Безготівкова оплата на рахунок компанії.
                  - Готівкою або платіжною карткою в салоні.
                  - Оплата при отриманні у відділенні кур’єрськоїслужби.`,
  },
  {
    title: 'Повернення товару',
    description: `
          Повернення товару належної якості протягом 14 днів здійснюється відповідно до Закону України “Про захист прав споживачів”.
          У період 14 днів, за винятком дня покупки, можна оформитиповернення товару за умов:
            - товар не був в експлуатації;
            - цілісність упаковки не порушена;
            - збережено документ, що підтверджує оплату.
          При виробництві шпалер завжди змінюється номер партії,тому при поверненні ми узгоджуємо наявність шпалер, які бажаєте повернути, на складі і лише тоді повертаєм.`,
  },
  {
    title: 'Політика конфіденційності',
    description: 'Політика конфіденційності.',
  },
];

export const article: {
  paymentAndDelivery: TyInfo,
  productReturn: TyInfo,
  privacyPolicy: TyInfo,
  personalDataProcessing: TyInfo,
} = {
  paymentAndDelivery: footerData[0],
  productReturn: footerData[1],
  privacyPolicy: footerData[2],
  personalDataProcessing: {
    title: 'Згода з умовами обробки персональних даних',
    description: `
    Вебсайт Decorativka та його складові вебсторінки (надалі разом ― «сайт») надаються ПП«Decorativka» (надалі ― «....», в тому числі «ми» і под.). Decorativka дбає про захист персональних даних, що можуть надаватись відвідувачами і користувачами сайту (надалі ― «вами», «ви», «ваші», «ваш» і под.) під час відвідування сайту, перегляду контенту, направлення заявки на участь та/або реєстрації на будь-який захід, заповнення, складання чи направлення компанії «Decorativka» засобами сайту будь-якого іншого звернення, опитування, підтвердження, відповіді, повідомлення та інше.
    Використовуючи сайт, ви надаєте компанії «Decorativka» згоду на обробку персональних даних та гарантуєте, що всі надані вами дані є достовірними та коректними."`,
  }
};
