import { FooterInfo } from '../types/FooterInfoModal';

export const footerData: FooterInfo[] = [
  {
    title: 'Оплата та доставка',
    description: `- Безготівкова оплата на рахунок компанії.
                  - Готівкою або платіжною карткою в салоні.
                  - Оплата на сайті.
                  - Оплата при отриманні у відділенні кур’єрськоїслужби.`,
  },
  {
    title: 'Повернення товару',
    description: `
          Повернення товару належної якості протягом 14 днів здійснюється відповідно до Закону України “Про захист прав споживачів”.
          У період 14 днів, за винятком дня покупки, можна оформитиповернення товару за умов:
            - товар не був в експлуатації;
            - цілісність упаковки не порушена;
            - збережено документ, що підтверджує оплату.
          При виробництві шпалер завжди змінюється номер партії,тому при поверненні ми узгоджуємо наявність шпалер, які бажаєте повернути, на складі і лише тоді повертаєм.`,
  },
  {
    title: 'Політика конфіденційності',
    description: 'Політика конфіденційності.',
  },
];
